 Import required packages with their customary aliases: Use the %matplotlib inline magic command that show your plots

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

Read the GDP and internet dataset into your notebook as a DataFrame called gdp_df, look at the first 6 rows.Exclude footnotes

In [2]:
gdp_df = pd.read_csv('data/gdp_percapita.csv')
gdp_df.head(n=6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  2190.240321              NaN
1     Afghanistan  2017  2202.570851              NaN
2     Afghanistan  2016  2200.764487              NaN
3     Afghanistan  2015  2212.750899              NaN
4     Afghanistan  2014  2249.253738              NaN
5     Afghanistan  2013  2264.317575              NaN

In [3]:
internet_df = pd.read_csv('data/internet_use.csv', nrows = 4495 )
internet_df.head(n=6)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

In [4]:
internet_df.tail(5)

     Country or Area  Year     Value  Value Footnotes
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

Look at the shape of each DataFrame - how many rows? How many columns?

In [5]:
gdp_df.shape

(6608, 4)

In [6]:
internet_df.shape

(4495, 4)

8 Take a look at the datatypes for the columns in each DataFrame.

In [7]:
gdp_df.info

<bound method DataFrame.info of      Country or Area                                      Year        Value  \
0        Afghanistan                                      2018  2190.240321
1        Afghanistan                                      2017  2202.570851
2        Afghanistan                                      2016  2200.764487
3        Afghanistan                                      2015  2212.750899
4        Afghanistan                                      2014  2249.253738
...              ...                                       ...          ...
6603        Zimbabwe                                      1992  3054.889178
6604        Zimbabwe                                      1991  3426.598094
6605        Zimbabwe                                      1990  3324.348171
6606   footnoteSeqID                                  Footnote          NaN
6607               2  Excludes South Sudan after July 9, 2011.          NaN

      Value Footnotes
0                 NaN
1                 NaN
2                 NaN
3                 NaN
4                 NaN
...               ...
6603              NaN
6604              NaN
6605              NaN
6606              NaN
6607              NaN

[6608 rows x 4 columns]>

9. Take a look at the last 10 rows of each DataFrame in turn.

In [8]:
gdp_df.tail(10)

,Country or Area,Year,Value,Value Footnotes
6598,Zimbabwe,1997,3580.048793,NaN
6599,Zimbabwe,1996,3520.430146,NaN
6600,Zimbabwe,1995,3226.413930,NaN
6601,Zimbabwe,1994,3263.934978,NaN
6602,Zimbabwe,1993,3033.504852,NaN
6603,Zimbabwe,1992,3054.889178,NaN
6604,Zimbabwe,1991,3426.598094,NaN
6605,Zimbabwe,1990,3324.348171,NaN
6606,footnoteSeqID,Footnote,NaN,NaN
6607,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [9]:
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

10. Drop the value footnotes column from both DataFrames.

In [10]:
gdp_df.drop(columns=['Value Footnotes'],inplace=True)
gdp_df.head(10)

  Country or Area  Year        Value
0     Afghanistan  2018  2190.240321
1     Afghanistan  2017  2202.570851
2     Afghanistan  2016  2200.764487
3     Afghanistan  2015  2212.750899
4     Afghanistan  2014  2249.253738
5     Afghanistan  2013  2264.317575
6     Afghanistan  2012  2220.481526
7     Afghanistan  2011  2037.608607
8     Afghanistan  2010  2093.743565
9     Afghanistan  2009  1881.777626

In [11]:
internet_df.drop(columns=['Value Footnotes'],inplace=True)
internet_df.head(10)

  Country or Area  Year     Value
0     Afghanistan  2014  6.390000
1     Afghanistan  2013  5.900000
2     Afghanistan  2012  5.454545
3     Afghanistan  2011  5.000000
4     Afghanistan  2010  4.000000
5     Afghanistan  2009  3.550000
6     Afghanistan  2008  1.840000
7     Afghanistan  2007  1.900000
8     Afghanistan  2006  2.107124
9     Afghanistan  2005  1.224148

11.Change the columns for the GDP Per Capita DataFrame to Country, Year, and GDP_Per_Capita.

In [13]:
gdp_df.rename(columns = {'Country or Area' : 'Country', 'Year' : 'Year', 'Value' : 'GDP_Per_Capita'}, inplace = True)
gdp_df.head(10)

       Country  Year  GDP_Per_Capita
0  Afghanistan  2018     2190.240321
1  Afghanistan  2017     2202.570851
2  Afghanistan  2016     2200.764487
3  Afghanistan  2015     2212.750899
4  Afghanistan  2014     2249.253738
5  Afghanistan  2013     2264.317575
6  Afghanistan  2012     2220.481526
7  Afghanistan  2011     2037.608607
8  Afghanistan  2010     2093.743565
9  Afghanistan  2009     1881.777626

12.Change the columns for the Internet Users DataFrame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [14]:
internet_df.rename(columns = {'Country or Area' : 'Country','Year' : 'Year','Value' : 'Internet_Users_Pct'}, inplace = True)
internet_df.head(10)

       Country  Year  Internet_Users_Pct
0  Afghanistan  2014            6.390000
1  Afghanistan  2013            5.900000
2  Afghanistan  2012            5.454545
3  Afghanistan  2011            5.000000
4  Afghanistan  2010            4.000000
5  Afghanistan  2009            3.550000
6  Afghanistan  2008            1.840000
7  Afghanistan  2007            1.900000
8  Afghanistan  2006            2.107124
9  Afghanistan  2005            1.224148

13.Merge the two DataFrames to one. Merge all rows from each of the two DataFrames. Call the new DataFrame gdp_and_internet_use.

In [15]:
#Data column Year in gdp_df is Object 64 vs internet_df is int64. Therefore for data to merge, change gdp_df to int as well

In [23]:
gdp_and_internet_use = gdp_df.concat(internet_df, how='outer', on=['Country', 'Year'])

AttributeError: 'DataFrame' object has no attribute 'concat'